# SystemClassification Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorElement..::..SystemClassification Property
ConnectorElement Class See Also
---
The system classification of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MEPSystemClassification SystemClassification { get; set; }
```

Visual Basic
---
```text
Public Property SystemClassification As MEPSystemClassification
	Get
	Set
```

Visual C++
---
```text
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
	void set (MEPSystemClassification value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | When setting this property: The MEPSystemType is not valid for the domain of this connector. |

# See Also
ConnectorElement Class
Autodesk.Revit.DB Namespace